// Напишите программу, которая на вход принимает число  и выдает его квадрат

System.Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int result = number*number;
System.Console.Write("Квадрат числа раввен ");
Console.WriteLine(result);