// Напишите программу, которая на вход принимает число  и выдает его квадрат
int number = 9;
int result = number*number;
Console.WriteLine(result);